package com.ladysparks.ttaenggrang.data.dummy

import com.ladysparks.ttaenggrang.data.model.dto.JobDto

object JobDummyData {
    val jobList = listOf(
        JobDto("시민", "무직", 1000, 100),
        JobDto("우체부", "일기 나눠주기", 3000, 2),
        JobDto("환경부", "아침 환기, 미세먼지 알림", 3200, 2),
        JobDto("통계청", "통신문 수거", 3500, 1),
        JobDto("국세청", "세금 사용 기록하기", 4000, 1),
        JobDto("신용평가위원", "매주 금요일 신용등급 정리", 3700, 1),
        JobDto("통계청장","숙제, 각종 교과서 검사",3800,1),
        JobDto("은행원","통장개설, 저축 확인",3600,2),
        JobDto("교실청소부","벌청소 없는 날 청소하기, 청소도구함 관리",2800,3),
        JobDto("칠판 청소부","매시간 칠판 정리하기",2900,1),
        JobDto("감사원","직업 수행 안되는 것 확인",3300,1),
        JobDto("투자 회사 직원","투자 상품 판매 및 투자 장부 관리",3900,2),
        JobDto("인테리어 디자이너","학급 꾸미기 돕기",3000,2),
        JobDto("쓰레기 수거업체","매주 월, 수 아침 분리수거",3100,2),
        JobDto("방역 요원","손 소독제 관리, 마스크 착용 체크",3200,2),
        JobDto("타임 키퍼","수업 시작 전 종 울림 알림 및 시간 체크",3500,1),
        JobDto("사회복지사","반 친구들의 고민을 들어주고, 도움 방법 정리",3700,1),
        JobDto("도서관 사서","교실 내 책장 정리, 도서 대출/반납 관리",3400,1),
        JobDto("치과 위생사","점심 식사 후 양치 권장 및 치약, 칫솔 관리",3000,1),
        JobDto("안내원","교실 행사나 학급 활동 진행 및 안내",3200,1),
        JobDto("한국 전력","교실 전기 제품 관리, 교실 불 관리",3800,1),
        JobDto("경찰","벌금 기록하기",3900,1),
        JobDto("기상청","매일 날씨 발표",3000,1),
        JobDto("광고 기획자","교실 포스터 제작 및 학급 행사 홍보",3300,1),
        JobDto("요리사","교실 간식 배분 및 배식 돕기",3100,2),
        JobDto("음악 감독","음악 시간 준비물 준비 및 악기 정리",3500,1),
        JobDto("조경사","교실 화분 관리, 식물 물 주기",3000,1),
        JobDto("미술 감독","미술 작품 전시 관리 및 꾸미기 활동 지원",3100,1),
        JobDto("비서","교사의 요청 사항 정리 및 알림 전달",3400,1),
        JobDto("체육 지도사","체육 준비물 점검 및 스트레칭 안내",3600,1),
        JobDto("미용사","학생들의 단정한 복장 및 머리 상태 확인",3200,1)
    )
}